Repository: GuillaumeBrochu/geneweb-debian
Catalog: po/*.po
Languages: de, pl

source: en[ translators, please see comment in PO files]
de: de
pl: pl

source: Geneweb default language:
de: Geneweb Standart Sprache:
pl: Domy¶lny jêzyk Geneweb:

source: Geneweb can display its prompts in a number of languages.
de: Geneweb kann Meldungen in verschiedenen Sprache anzeigen.
pl: Geneweb mo¿e rozmawiaæ w wielu jêzykach.

source: Select a default language for Geneweb to use in its page rendering.
de: Bitte wählen Sie die Standart Sprache aus in der Geneweb die Seiten erstellen soll.
pl: Wybierz domy¶lny jêzyk, jakiego ma u¿ywaæ Geneweb na generowanych przez niego stronach.

source: Other languages will still be available.
de: Andere Sprachen bleiben weiterhin verfügbar.
pl: Inne jêzyki nadal bêd± dostêpne.

source: Geneweb daemon listening port:
de: Geneweb Dämon Listening (engl.: lauschen) Port:
pl: Port nas³uchiwania deamona geneweb:

source: The port used by the geneweb daemon (gwd) for incoming connections may be configured here.
de: Der Port auf dem der Geneweb Dämon lauschen soll kann hier konfiguriert werden.
pl: Mo¿esz skonfigurowaæ port, na którym bêdzie nas³uchiwa³ daemon geneweb (gwd).

source: Choose a port number above 1023 for the port gwd will listen to.
de: Wählen Sie eine Port Nummer über 1023 für den Port auf dem gwd lauschen soll.
pl: Wybierz port dla gwd o numerze wy¿szym od 1023.

source: If unsure, leave the default value of 2317.
de: Wenn Sie sich unsicher sind belassen Sie den Standart Wert von 2317.
pl: Je¶li nie jeste¶ pewien, zostaw domy¶ln± warto¶æ 2317.

source: Manual
de: Manuell
pl: Rêcznie

source: Always on
de: Immer an
pl: Zawsze w³±czaj

source: Geneweb start mode:
de: Geneweb Start Modus:
pl: Rodzaj uruchamiania Geneweb:

source: The Geneweb daemon gwd can be launched automatically at startup, manually by the system administrator, or by any user when it is needed.
de: Der Geneweb Dämon gwd kann automatisch beim Startvorgang, manuell vom System Administrator oder bei Bedarf von einem Benutzer gestartet werden.
pl: Demon Geneweb, gwd, mo¿e byæ uruchamiany automatycznie przy starcie systemu, rêcznie przez administratora lub przez u¿ytkownika wtedy, gdy jest on potrzebny.

source: If you choose "Always on", Geneweb will be launched at the system startup.
de: Wenn Sie "Immer an" auswählen wird Geneweb bei jedem Starvorgang gestartet.
pl: Je¶li wybierzesz "Zawsze w³±czaj", Geneweb bêdzie uruchamiany podczas uruchamiania systemu.

source: If you want to prevent the automatic startup of Geneweb, for example if you prefer to run it as a CGI program, then choose "Manual".
de: Wenn Sie den automatischen Startvorgang von Geneweb verhindern möchten, z.B. weil Sie es vorziehen das Programm als CGI laufen zu lassen, dann wählen Sie bitte "Manuell".
pl: Je¶li chcesz zapobiec automatycznemu uruchamianiu Geneweb, przyk³adowo chc±c uruchamiaæ go jako program CGI, wybierz "Rêcznie".

source: Old directory /var/geneweb not removed
de: Altes Verzeichnis /var/geneweb wurde nicht gelöscht.
pl: Stary katalog /var/geneweb nie usuniêty

source: Previous versions of both official and unofficial packages for Geneweb used non FHS-compliant /var/geneweb directory for storing databases.
de: Die vorherigen beiden offiziellen und inoffiziellen Packet Versionen von Geneweb benutzten eine nicht FHS-Kompatible Verzeichnisstruktur um die Datenbank zu speichern.
pl: Poprzednie wersje zarówno oficjalnych jak i nieoficjalnych pakietów Geneweb do przechowywania bazy danych korzysta³y z katalogu /var/geneweb, który nie jest zgodny z FHS.

source: It has been detected that this directory was used on your system. Some files have been moved from there to /var/lib/geneweb but the geneweb installation scripts found some unexpected files in /var/geneweb.
de: Es wurde auf Ihrem System entdeckt, dass dieses Verzeichnis benutzt wurde. Einige Dateien wurden von dort nach /var/lib/geneweb verschoben, aber die geneweb Installations Skripte haben einige unerwartete Dateien in /var/geneweb gefunden.
pl: Wszystko wskazuje na to, ¿e ten katalog jest u¿ywany równie¿ w Twoim systemie. Niektóre pliki zosta³y przeniesione do /var/lib/geneweb, jednak skrypty instalacyjne geneweb znalaz³y równie¿ nieznane pliki w /var/geneweb.

source: Thus the directory has been left intact. It is highly recommended that you check the remaining files there and move them to /var/lib/geneweb, then remove the /var/geneweb directory.
de: Deswegen wurde das Verzeichnis nicht verändert. Es wird dringend empfohlen, dass Sie die dortigen Dateien prüfen und nach /var/lib/geneweb verschieben und dann /var/geneweb löschen.
pl: Z tego powodu katalog pozosta³ nienaruszony. Zaleca siê, by sprawdziæ pozosta³e pliki i przenie¶æ je do /var/lib/geneweb, po czym usun±æ katalog /var/geneweb.

source: Old setup file moved
de: Alte Setup Dateien wurden verschoben.
pl: Stary plik ustawieñ przeniesiony

source: Previous versions of both official and unofficial packages for Geneweb used a file named /etc/geneweb/genewebrc for keeping local setup for the listening port and the default language of the program.
de: Vorherige Versionen, sowohl die der Offiziellen als auch die der Inoffiziellen Pakete von Geneweb, benutzten eine Datei namens /etc/geneweb/genewebrc um das Lokale Setup für die Port-Nr. und die Standart Sprache des Programms zu speichern.
pl: Poprzednie wersje zarówno oficjalnych jak i nieoficjalnych pakietów Geneweb do przechowywania lokalnej konfiguracji portu i domy¶lnego jêzyka programu korzysta³y z pliku /etc/geneweb/geneweb.

source: Debian standards suggest such file to live in /etc/default/geneweb.
de: Der Debian Standart schlägt jedoch vor, dass solche Dateien in /etc/default/geneweb abgelegt werden.
pl: Standardy Debiana zalecaj±, by ten plik umie¶ciæ w /etc/default/geneweb.

source: The configuration file has been moved and renamed to /etc/default/geneweb.
de: Die Konfigurationsdatei wurde verschoben und umbenannt zu /etc/default/geneweb.
pl: Plik konfiguracyjny zosta³ przeniesiony wraz ze zmian± nazwy na /etc/default/geneweb.

source: This note will only appear once except if you inadvertently re-create /etc/geneweb/genewebrc.
de: Dieser Hinweis erscheint nur einmal, es sei denn, Sie haben unbeabsichtigt die Datei /etc/geneweb/genewebrc neu erstellt.
pl: Ten komunikat pojawi siê tylko raz, chyba ¿e przypadkowo ponownie utworzysz plik /etc/geneweb/genewebrc.

source: Remove Geneweb database directory on package purge?
de: Soll das Datenbank Verzeichnis beim entfernen von geneweb mit gelöscht werden?
pl: Czy usun±æ katalog z baz± danych Geneweb podczas czyszczenia pakietu?

source: Geneweb's databases will be stored in the database directory /var/lib/geneweb. These databases may be put there by authorized users who must be members of the "geneweb" group.
de: Geneweb's Datenbanken werden in der Datenbank im Verzeichnis /var/lib/geneweb gespeichert. Diese Datenbanken können dort von Authorisierten Benutzern, Mitglieder der Gruppe "geneweb", angelegt werden.
pl: Bazy Geneweb bêd± przechowywane w katalogu /var/lib/geneweb. Te bazy danych mog± byæ tam umieszczane przez autoryzowanych u¿ytkowników nale¿±cych do grupy "geneweb".

source: Please choose whether you want to remove databases automatically when purging the package (completely removing it).
de: Bitte wählen Sie aus, ob Sie beim entfernen des Packetes (vollständiges entfernen) die Datenbanken automatisch mit löschen möchten.
pl: Czy chcesz automatycznie mieæ usuwane bazy danych podczas czyszczenia pakietu (ca³kowite usuwanie)?.

source: THIS WOULD ERASE USER-OWNED DATA. You have to be sure if you accept the purge.
de: DIES LÖSCHT BENUTZEREIGENE DATEN. Sie sollten sich sicher sein, wenn Sie die nächste Frage mit "Ja" beantworten.
pl: TO USUNIE DANE U¯YTKOWNIKÓW. Musisz mieæ pewno¶æ, ¿e tego chcesz.

source: Note that if this directory is empty at the time you purge or simply remove the package, it will always be automatically removed.
de: Beachten Sie, falls das Verzeichnis beim entfernen des Packets leer ist, wird das Verzeichnis automatisch mit entfernt.
pl: Pamiêtaj, ¿e je¶li ten katalog jest pusty podczas czyszczenia lub zwyk³ego usuwania pakietu, bêdzie on automatycznie usuwany.

source: Remove /etc/geneweb/lang and /etc/geneweb/etc?
de: Sollen /etc/geneweb/lang und /etc/geneweb/etc entfernt werden?
pl: Usun±æ /etc/geneweb/lang i /etc/geneweb/etc?

source: Former versions of the geneweb packages used /etc/geneweb/etc and /etc/geneweb/lang directories for generated HTML pages default templates.
de: Vorherige Versionen von dem Geneweb Paket benutzten die Verzeichnisse /etc/geneweb/etc und /etc/geneweb/lang für Standart generierte Template HTML Seiten.
pl: Poprzednie wersje pakietów geneweb korzysta³y z katalogów /etc/geneweb/etc i /etc/geneweb/lang jako szablonów generowanych domy¶lnych stron HTML.

source: These templates are strongly dependent on the Geneweb version (for instance, translations updates occur there). So, it is not a good idea to customise them.
de: Diese Templates sind stark von der jeweiligen Geneweb Version abhänging (z.B., Übersetzungsaktualisierungen finden dort statt). Es ist daher keine gute Idee diese selbst zu anzupassen.
pl: Te szablony s± ¶ci¶le zale¿ne od wersji Geneweb (np. tutaj nastêpuj± uaktualnienia t³umaczeñ). Przewa¿nie lepiej ich nie zmieniaæ.

source: These files have been moved to /usr/share/geneweb/etc and /usr/share/geneweb/lang.
de: Diese Dateien wurden nach /usr/share/geneweb/etc und /usr/share/geneweb/lang verschoben.
pl: Pliki te zosta³y przeniesione do /usr/share/geneweb/etc i /usr/share/geneweb/etc.

source: If you never customised these files, they may be safely removed. Just accept the removal now.
de: Wenn Sie diese Dateien niemals selbst angepasst haben, dann können sie problemlos entfernt werden. Akzeptieren Sie jetzt einfach das entfernen.
pl: Je¶li te pliki nie by³y zmieniane przez Ciebie, mog± one zostaæ spokojnie usuniête. W takim przypadku po prostu wyra¼ zgodê na usuniêcie.

source: You may choose to keep them "just in case".
de: Sie können auch "für alle Fälle" die Dateien behalten.
pl: Mo¿esz wybraæ by zatrzymaæ je "na wszelki wypadek".
