Repository: GuillaumeBrochu/geneweb-debian
Catalog: debian/po/*.po
Languages: cs, fi

source: en[ translators, please see comment in PO files]
cs: cs
fi: fi

source: Geneweb default language:
cs: Standardní jazyk Genewebu:
fi: Geneweb-k‰yttˆliittym‰n oletuskieli:

source: Geneweb can display its prompts in a number of languages.
cs: Geneweb umí zobrazit své hlá¹ky v rùzných jazycích.
fi: Geneweb-ohjelman k‰yttˆliittym‰n kieli voidaan valita useista mahdollisista.

source: Select a default language for Geneweb to use in its page rendering.
cs: Vyberte hlavní jazyk, ve kterém se mají zobrazovat stránky Genewebu.
fi: Valitse kieli, jota sivuilla k‰ytet‰‰n oletuksena.

source: Other languages will still be available.
cs: Ostatní jazyky budou stále dostupné.
fi: Muutkin kielet ovat yh‰ k‰ytett‰viss‰.

source: Geneweb daemon listening port:
cs: Geneweb bude naslouchat na portu:
fi: Geneweb-palveluprosessin k‰ytt‰m‰ porttinumero:

source: The port used by the geneweb daemon (gwd) for incoming connections may be configured here.
cs: Zde mù¾ete nastavit port, na kterém bude Geneweb (gwd) naslouchat pøíchozím spojením.
fi: Portti, jota geneweb-palveluprosessi (gwd) k‰ytt‰‰ sis‰‰ntuleviin yhteyksiin voidaan asettaa t‰ss‰.

source: Choose a port number above 1023 for the port gwd will listen to.
cs: Vyberte port vìt¹í ne¾ 1023, na kterém bude gwd naslouchat.
fi: Valitse sen portin numero, mit‰ gwd kuuntelee (yli 1023).

source: If unsure, leave the default value of 2317.
cs: Pokud si nejste jisti, ponechte standardní hodnotu 2317.
fi: Jos olet ep‰varma, k‰yt‰ oletusarvoa 2317.

source: Manual
cs: Ruèní
fi: Tarvittaessa

source: Always on
cs: V¾dy zapnutý
fi: Aina p‰‰ll‰

source: Geneweb start mode:
cs: Zpùsob startu Genewebu:
fi: Ohjelman k‰ynnistystapa:

source: The Geneweb daemon gwd can be launched automatically at startup, manually by the system administrator, or by any user when it is needed.
cs: Démon gwd mù¾e být spu¹tìn automaticky pøi startu, nebo ruènì podle potøeby.
fi: Geneweb-palveluprosessi gwd voidaan k‰ynnist‰‰ joko automaattisesti, p‰‰k‰ytt‰j‰n k‰ynnist‰m‰n‰ tai kenen tahansa k‰ytt‰j‰n k‰ynnist‰m‰n‰ tarvittaessa.

source: If you choose "Always on", Geneweb will be launched at the system startup.
cs: Pokud zvolíte "V¾dy zapnutý", Geneweb se bude spou¹tìt pøi startu systému.
fi: Jos valitset "Aina p‰‰ll‰", geneweb-palveluprosessi k‰ynnistet‰‰n aina j‰rjestelm‰n k‰ynnistyksess‰.

source: If you want to prevent the automatic startup of Geneweb, for example if you prefer to run it as a CGI program, then choose "Manual".
cs: Pokud chcete pøedejít automatickému startu Genewebu, napøíklad pokud jej chcete spouètìt jako CGI, pak vyberte "Ruèní".
fi: Jos ohjelman automaattinen k‰ynnistyminen halutaan est‰‰ (esimerkiksi jos geneweb-ohjelmaa halutaan k‰ytt‰‰ CGI-ohjelmana), valitse "Tarvittaessa".

source: Old directory /var/geneweb not removed
cs: Starý adresáø /var/geneweb nebyl odstranìn
fi: Vanhaa /var/geneweb hakemistoa ei poistettu

source: Previous versions of both official and unofficial packages for Geneweb used non FHS-compliant /var/geneweb directory for storing databases.
cs: Pøedchozí verze Genewebu pou¾ívaly pro ulo¾ení databáze adresáø /var/geneweb, co¾ není v souladu s FHS.
fi: Aikaisemmat sek‰ viralliset ett‰ ep‰viralliset Geneweb-paketit k‰yttiv‰t /var/geneweb-hakemistoa tietokannen tallettamiseen, mik‰ ei ole FHS-tiedostostandardin mukaista.

source: It has been detected that this directory was used on your system. Some files have been moved from there to /var/lib/geneweb but the geneweb installation scripts found some unexpected files in /var/geneweb.
cs: Tento adresáø se nachází i na va¹em systému. Nìkteré soubory byly pøesunuty do /var/lib/geneweb, av¹ak instalaèní skripty ve /var/geneweb nalezly je¹tì neoèekávané soubory.
fi: T‰ss‰ j‰rjestelm‰ss‰ on k‰ytetty /var/geneweb-hakemistoa. Jotkut tiedostot sielt‰ on nyt siirretty /var/lib/geneweb-hakemistoon, mutta hakemistoon j‰i tiedostoja, joita asennusohjelma ei tunnista.

source: Thus the directory has been left intact. It is highly recommended that you check the remaining files there and move them to /var/lib/geneweb, then remove the /var/geneweb directory.
cs: Adresáø byl zachován. Doporuèujeme zkontrolovat zbývající soubory, pøesunout je do /var/lib/geneweb a poté smazat /var/geneweb.
fi: T‰m‰n vuoksi hakemisto on j‰tetty j‰ljelle. On hyvin suositeltavaa, ett‰ tarkastat j‰ljelle j‰‰neet tiedostot, siirr‰t ne k‰sin hakemistoon /var/lib/geneweb ja poistat vanhan hakemiston.

source: Old setup file moved
cs: Staré nastavení pøesunuto

source: Previous versions of both official and unofficial packages for Geneweb used a file named /etc/geneweb/genewebrc for keeping local setup for the listening port and the default language of the program.
cs: Pøedchozí verze Genewebu pou¾ívaly pro ulo¾ení lokálního nastavení (port a standardní jazyk) soubor /etc/geneweb/genewebrc.

source: Debian standards suggest such file to live in /etc/default/geneweb.
cs: Standardy Debianu doporuèují umístit takový soubor do /etc/default/geneweb.

source: The configuration file has been moved and renamed to /etc/default/geneweb.
cs: Konfiguraèní soubor byl pøesunut a pøejmenován na /etc/default/geneweb.

source: This note will only appear once except if you inadvertently re-create /etc/geneweb/genewebrc.
cs: Tato poznámka se objeví pouze jednou. (Pokud ov¹em znovu omylem /etc/geneweb/genewebrc nevytvoøíte.)

source: Remove Geneweb database directory on package purge?
cs: Odstranit databázi Genewebu pøi odstranìní balíku?
fi: Pit‰isikˆ tietokanta tuhota asetusten poistossa?

source: Geneweb's databases will be stored in the database directory /var/lib/geneweb. These databases may be put there by authorized users who must be members of the "geneweb" group.
cs: Databáze Genewebu budou ulo¾eny v adresáøi /var/lib/geneweb. Tyto databáze sem mohou umístit autorizovaní u¾ivatelé ze skupiny "geneweb".
fi: Tietokanta talletetaan hakemistoon /var/lib/geneweb. Tietokantoja sinne voivat tallettaa sinne sellaiset k‰ytt‰j‰t, jotka kuuluvat k‰yttˆoikeusryhm‰‰n "geneweb".

source: Please choose whether you want to remove databases automatically when purging the package (completely removing it).
cs: Vyberte, zda chcete pøi kompletním odstranìní balíku (purge) automaticky odstranit i databáze.
fi: Valitse tuhotaanko tietokannat samalla, kun muu geneweb-paketti poistetaan t‰ydellisesti asetuksineen (purge).

source: THIS WOULD ERASE USER-OWNED DATA. You have to be sure if you accept the purge.
cs: TÍMTO BYSTE SMAZALI U®IVATELSKÁ DATA. Pøi odstraòování si musíte být naprosto jisti.
fi: TƒMƒ POISTAA KƒYTTƒJIEN OMISTAMIA TIETOJA. Jos hyv‰ksyt poiston, sinun on oltava varma siit‰.

source: Note that if this directory is empty at the time you purge or simply remove the package, it will always be automatically removed.
cs: Pokud by byl adresáø v dobì odstraòování balíku prázdný, sma¾e se v¾dy.
fi: Huomaa, ett‰ jos hakemisto on tyhj‰ silloin, kun geneweb-paketti poistetaan, hakemisto poistetaan aina automaattisesti.

source: Remove /etc/geneweb/lang and /etc/geneweb/etc?
cs: Odstranit /etc/geneweb/lang a /etc/geneweb/etc?

source: Former versions of the geneweb packages used /etc/geneweb/etc and /etc/geneweb/lang directories for generated HTML pages default templates.
cs: Døívìj¹í verze balíkù genewebu pou¾ívaly pro standardní HTML ¹ablony adresáøe /etc/geneweb/etc a /etc/geneweb/lang.

source: These templates are strongly dependent on the Geneweb version (for instance, translations updates occur there). So, it is not a good idea to customise them.
cs: Tyto ¹ablony jsou velmi závislé na verzi Genewebu (napøíklad se tam objevují aktualizace pøekladù), tak¾e není dobrý nápad si je pøizpùsobovat.

source: These files have been moved to /usr/share/geneweb/etc and /usr/share/geneweb/lang.
cs: Tyto soubory byly pøesunuty do /usr/share/geneweb/etc a /usr/share/geneweb/lang.

source: If you never customised these files, they may be safely removed. Just accept the removal now.
cs: Pokud jste tyto soubory nikdy neupravovali, mù¾ete je nyní klidnì odstranit.

source: You may choose to keep them "just in case".
cs: Také si je mù¾ete ponechat "pro strýèka Pøíhodu".

source: Gwsetup daemon listening port:
fi: Gwsetup-palveluprosessin k‰ytt‰m‰ porttinumero:

source: The port used by the gwsetup daemon for incoming connections may be configured here.
fi: Portti, jota gwsetup-palveluprosessi k‰ytt‰‰ sis‰‰ntuleviin yhteyksiin voidaan asettaa t‰ss‰.

source: Choose a port number above 1023 for the port gwsetup will listen to.
fi: Valitse sen portin numero, mit‰ gwsetup kuuntelee (yli 1023).

source: If unsure, leave the default value of 2316.
fi: Jos olet ep‰varma, k‰yt‰ oletusarvoa 2316.

source: Gwsetup start mode:
fi: Gwsetup-ohjelman k‰ynnistystapa:

source: The Gwsetup daemon can be launched automatically at startup, manually by the system administrator, or by any user when it is needed.
fi: Gwsetup-palveluprosessi voidaan k‰ynnist‰‰ joko automaattisesti, p‰‰k‰ytt‰j‰n k‰ynnist‰m‰n‰ tai kenen tahansa k‰ytt‰j‰n k‰ynnist‰m‰n‰ tarvittaessa.

source: If you choose "Always on", gwsetup will be launched at the system startup.
fi: Jos valitset "Aina p‰‰ll‰", gwsetup-palveluprosessi k‰ynnistet‰‰n aina j‰rjestelm‰n k‰ynnistyksess‰.

source: If you want to prevent the automatic startup of gwsetup, then choose "Manual".
fi: Jos ohjelman automaattinen k‰ynnistyminen halutaan est‰‰, valitse "Tarvittaessa".
